tutorials/oscillatingCore/oscillatingCore/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          60;
        startFace       29;
    }
    top
    {
        type            patch;
        nFaces          1;
        startFace       89;
    }
    bottom
    {
        type            patch;
        nFaces          1;
        startFace       90;
    }
    walls
    {
        type            patch;
        nFaces          60;
        startFace       91;
    }
)

// ************************************************************************* //
